on_lesson = ["ნატა კვანტალიანი", "ილია კვიციანი", "ზურა გვალია", "გიორგი გამსახურდია", "ლილე ცხვარაძე", "ნიკოლოზ ხარაბაძე", "იგორ კამენსკი" "გიორგი მინდორაშვილი", "ლუკა მსხალაძე", "ერეკლე ძინძიბაძე", "ლუკა მსხავაძე", "ნუკი გაგნიძე", "დაჩი გიორგაძე", "გიორგი თაყაძე", "კოტე ხიმშიაშვილი", "ლუკა ტატუაშვილი", "ნიკა კუბლაშვილი", "დავით ადეაშვილი", "სანდრო მაისურაძე", "ლუკა მჭედლიძე", "ჯარჯი მჭედლიძე", "ანი გიგაური", "ანდრია კობახიძე","გიგა კოჩალიძე", "ანდრია ალავიძე", "ზუკა ქორიძე", "გიორგი შავაძე", "გობრონ წითლაური", "გიორგი წიკლაური", "გიორგი თაყაძე", "ცოტნე სეხნიაშვილი", "ნიკა მაჭარაშვილი", "ალექს ჯიმშიაშვილი", "ილია ძინძიბაძე"]
plus = ["გიორგი გამსახურდია","ზუკა ქორიძე", "ცოტნე სეხნიაშვილი", "ანდრია ალავიძე", "გიორგი შავაძე", "ალექს ჯიმშიაშვილი", "ლუკა ტატუაშვილი", "სანდრო მაისურაძე", "ლუკა ტატუაშვილი", "კოტე ხიმშიაშვილი","ნატა კვანტალიანი", "ერეკლე ძინძიბაძე", "ლილე ცხვარაძე", "ლაშა გიორგი", "გიგა კოჩალიძე", "ანი გიგაური", "დავით ადეიშვილი", "ანდრია კობახიძე", "ნუკი გაგნიძე", "გიორგი თაყაძე", "მარიამ მჭედლიშვილი", "იგორ კამენსკი", "ლუკა მჭედლიძე"]
impostor = []
for i in on_lesson:
    if i not in plus:
        impostor.append(i)
print(impostor)    